jamestutton/ESP8266/ESP8266_Display/CustMQTT.cpp
#include "MQTT.h"
#include <ESP8266httpUpdate.h>
#include "SSD1306.h"
#include "Log.h"

/* MQTT OTA over HTTP server is supported by publich the message using mosquitto_pub, for example
 * mosquitto_pub -t "/home/devicestatus/display/fwotalink" -m "http://192.168.1.129:8000/ESP8266_Display.ino.d1.bin"
 */

extern SSD1306  display;

extern char device_name[];

extern void display_mqtt_status(boolean connected);

static int topcis_inited = 0;

const char * mqtt_topics[] = {
  "/home/garage/sonicsensor/doorstatus",
  "/home/room1/tempsensor/temperature",
  "/home/room2/tempsensor/temperature",
  "/home/room3/tempsensor/temperature",
  "/home/room4/tempsensor/temperature",
  "/home/room5/tempsensor/temperature",
  "/home/devicestatus/display/fwotalink",
};
const char *mqtt_notification_topics_src[] = {
  "/home/devicestatus/%s/status",
};
const char *mqtt_notification_topics[MAX_MQTT_NOTIFICATION_TOPICS] = { NULL, };
char *mqtt_will_message = NULL;
bool updated = false;

mqtt_topic_type last_focus = MAX_MQTT_TOPICS;

void set_focus(mqtt_topic_type focus) {
  switch (last_focus) {
    case SONIC_SENSOR1_DOOR_STATUS:
      display.setColor(BLACK);
      display.fillRect(0, 16, 4, 16);
      break;
    case TEMP_SENSOR1_TEMPERATURE:
      display.setColor(BLACK);
      display.fillRect(0, 32, 4, 16);
      break;
    case TEMP_SENSOR2_TEMPERATURE:
      display.setColor(BLACK);
      display.fillRect(40, 32, 4, 16);
      break;
    case TEMP_SENSOR3_TEMPERATURE:
      display.setColor(BLACK);
      display.fillRect(80, 32, 4, 16);
      break;
    case TEMP_SENSOR4_TEMPERATURE:
      display.setColor(BLACK);
      display.fillRect(0, 48, 4, 16);
      break;
    case TEMP_SENSOR5_TEMPERATURE:
      display.setColor(BLACK);
      display.fillRect(40, 48, 4, 16);
      break;
    default:
      break;
  }

  last_focus = focus;
  switch (last_focus) {
    case SONIC_SENSOR1_DOOR_STATUS:
      display.setColor(WHITE);
      display.fillRect(0, 16 + 4, 4, 16 - 10);
      break;
    case TEMP_SENSOR1_TEMPERATURE:
      display.setColor(WHITE);
      display.fillRect(0, 32 + 4, 4, 16 - 10);
      break;
    case TEMP_SENSOR2_TEMPERATURE:
      display.setColor(WHITE);
      display.fillRect(40, 32 + 4, 4, 16 - 10);
      break;
    case TEMP_SENSOR3_TEMPERATURE:
      display.setColor(WHITE);
      display.fillRect(80, 32 + 4, 4, 16 - 10);
      break;
    case TEMP_SENSOR4_TEMPERATURE:
      display.setColor(WHITE);
      display.fillRect(0, 48 + 4, 4, 16 - 10);
      break;
    case TEMP_SENSOR5_TEMPERATURE:
      display.setColor(WHITE);
      display.fillRect(40, 48 + 4, 4, 16 - 10);
      break;
    default:
      break;
  }
}

void mqtt_client_callback(mqtt_topic_type topic_index, String &valuestr) {
  switch (topic_index) {
    case SONIC_SENSOR1_DOOR_STATUS:
      display.setTextAlignment(TEXT_ALIGN_CENTER);
      if (valuestr == "OPEN") {
        display.setColor(WHITE);
        display.fillRect(6, 16, 60, 14);
        display.setColor(BLACK);
        display.drawString(36, 16, valuestr);
      }
      else {
        display.setColor(BLACK);
        display.fillRect(6, 16, 60, 14);
        display.setColor(WHITE);
        display.drawRect(6, 16, 60, 14);
        display.drawString(36, 16, valuestr);
      }
      display.setTextAlignment(TEXT_ALIGN_LEFT);
      break;
    case TEMP_SENSOR1_TEMPERATURE:
      display.setColor(BLACK);
      display.fillRect(6, 32, 40, 16);
      display.setColor(WHITE);
      display.drawString(6, 32, valuestr);
      break;
    case TEMP_SENSOR2_TEMPERATURE:
      display.setColor(BLACK);
      display.fillRect(46, 32, 40, 16);
      display.setColor(WHITE);
      display.drawString(46, 32, valuestr);
      break;
    case TEMP_SENSOR3_TEMPERATURE:
      display.setColor(BLACK);
      display.fillRect(86, 32, 40, 16);
      display.setColor(WHITE);
      display.drawString(86, 32, valuestr);
      break;
    case TEMP_SENSOR4_TEMPERATURE:
      display.setColor(BLACK);
      display.fillRect(6, 48, 40, 16);
      display.setColor(WHITE);
      display.drawString(6, 48, valuestr);
      break;
    case TEMP_SENSOR5_TEMPERATURE:
      display.setColor(BLACK);
      display.fillRect(46, 48, 40, 16);
      display.setColor(WHITE);
      display.drawString(46, 48, valuestr);
      break;
    case DEVICE_FIRMWARE_OTA_LINK:
      if (valuestr.length() > 10) {
        gLog.printf("OTA update from %s\n", valuestr.c_str());
        ESPhttpUpdate.rebootOnUpdate(false);
        t_httpUpdate_return ret = ESPhttpUpdate.update(valuestr);
        switch(ret) {
          case HTTP_UPDATE_FAILED:
            gLog.printf("HTTP_UPDATE_FAILD Error (%d): %s", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
            break;
          case HTTP_UPDATE_NO_UPDATES:
            gLog.println("HTTP_UPDATE_NO_UPDATES");
            break;
          case HTTP_UPDATE_OK:
            gLog.println("HTTP_UPDATE_OK");
            updated = true;
            setup_mqtt();
            client.publish(mqtt_topics[DEVICE_FIRMWARE_OTA_LINK], "", true);
            client.loop();
            ESP.restart();
            break;
        }
      }
      break;
    default:
      break;
  }
  set_focus(topic_index);
  display.display();
}

int mqtt_setup_message(void) {
  int i;
  char temp[128];

  if (!topcis_inited) {
    topcis_inited = 1;
    for (i = 0; i < MAX_MQTT_NOTIFICATION_TOPICS; i ++) {
      if (mqtt_notification_topics[i]) {
        free((void *)mqtt_notification_topics[i]);
      }
      sprintf(temp, mqtt_notification_topics_src[i], device_name);
      mqtt_notification_topics[i] = strdup(temp);
    }
    if (mqtt_will_message) {
      free(mqtt_will_message);
    }
    //sprintf(temp, "Device [%s] offline", device_name);
    sprintf(temp, "Offline");
    mqtt_will_message = strdup(temp);
  }
}

int mqtt_connect_callback(bool connected) {
  int i;

  if (connected) {
    display_mqtt_status(true);
    if (!updated) {
      client.subscribe(mqtt_topics[DEVICE_FIRMWARE_OTA_LINK], 1);
    }
    for (i = 0; i < MAX_MQTT_TOPICS; i ++) {
      if (i != DEVICE_FIRMWARE_OTA_LINK) {
        client.subscribe(mqtt_topics[i]);
      }
    }

    char temp[64];
    //sprintf(temp, "Device [%s] online", device_name);
    sprintf(temp, "Online");
    client.publish(mqtt_notification_topics[NOTIFICATION_DEVICE_STATUS], temp, true);
  }
  else {
    display_mqtt_status(false);
    delay(1000);
  }
}

